import numpy as np
import matplotlib.pyplot as plt
import math
x = [9,	12,	13,	14,	15,	16,	17,	18,	19,	20,	21,	22,	23,	24,	25,	26,	27,	28,	29,	30,	32,	33,	34,	35]
y = [0.005,	0.005,	0.03,	0.045,	0.085,	0.045, 0.08,	0.055,	0.075,	0.135,	0.07,	0.06,	0.035,	0.05,	0.08,	0.02,	0.035,	0.03,	0.02,	0.015,	0.005,	0.01,	0.005,	0.005]

plt.bar(x, y, label='столбики', color = 'pink', alpha=0.4 )
plt.xlabel('Количество импульсов')
plt.ylabel('Доля случаев')
plt.title('Доля случаев фиксирования счетчиком Гейгера данного количества импульсов')
plt.legend(loc='upper right')
plt.show()